# DS_GetOpacity

## Description
Returns document shadow opacity.

```pascal
FUNCTION DS_GetOpacity : LONGINT;
```

```python
def vs.DS_GetOpacity():
    return LONGINT
```

## Version
Availability: from Vectorworks 2014

## Category
* Document Attributes